Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ལྷ་དང་ལྷ་མིན་ཀླུ་དང་གནོད་སྦྱིན་ཚོགས། །མི་འམ་ཅི་དང་གྲུལ་བུམ་ནམ་མཁའ་ལྡིང་།
en: Assemblies of devas, asuras, and nāgas, Yakṣas, kinnaras, mahoragas, and garuḍas,

source: །དེ་བཞིན་ཡི་དགས་སྲུལ་པོ་མང་པོ་དག །སྐྱེས་བུ་མཆོག་ལ་རི་མོར་བྱ་བ་བྱེད།
en: And similarly, a multitude of pretas and pūtanas Showed their respect to the supreme being. {82}

source: །འདྲེན་པ་གྲོང་ཁྱེར་མཆོག་དེར་གཤེགས་པ་ན། །རྒྱལ་བ་མཆོག་ལ་དེ་དག་མཆོད་པ་བྱེད།
en: They made offerings to the supreme Jina When the Guide entered the supreme city.

source: །ལྷ་དང་ལྷ་མིན་ཀླུ་དང་གནོད་སྦྱིན་རྒྱལ།
en: The kings of the devas, asuras, nāgas, and yakṣas

source: །བལྟ་བས་རྟག་ཏུ་ཆོག་པར་ཡང་མི་འགྱུར།
en: Could not get their fill of looking at him. {83}

source: །སྔོན་གྱི་སྲིད་པར་འཇིག་རྟེན་མགོན་པོ་ཡིས།
en: In previous existences the Lord of the World

source: །སྔོན་གྱི་རྒྱལ་བ་དག་ལ་མཆོད་མཆོག་བྱས།
en: Had made perfect offerings to the jinas of the past.

source: །བསོད་ནམས་འབྲས་བུ་སྨིན་པ་དེ་འདྲ་སྟེ།
en: This was the ripened result of that merit.

source: །སྐྱེས་བུ་མི་དབང་བལྟ་བས་ངོམས་མི་མྱོང་།
en: The beings could not stop looking at the Lord of humans. {84}

source: །རྒྱལ་བས་སངས་རྒྱས་ཞིང་དུ་འོད་བཏང་ཚེ།
en: When the Jina shone light through the buddha realm,

source: །ལྷུན་པོ་དེ་བཞིན་རབ་ལྷུན་ཁོར་ཡུག་རི།
en: Meru, and similarly Sumeru and Cakravāla

source: །ཁ་བ་ཅན་གྱི་རི་དང་སྤོས་ངད་ལྡང་།
en: The Himagiri and Gandhamādana

source: །དེ་དག་རྒྱལ་བའི་འོད་ལ་སྒྲིབ་པ་མེད།
en: Could not obscure the Jina’s light. {85}

source: །སངས་རྒྱས་ཞིང་འདིའི་རྒྱ་མཚོ་ཅི་ཡོད་པ།
en: All of the oceans in this buddha realm

source: །དེ་དག་དེ་ཚེ་ས་དང་འདྲ་བར་གྱུར།
en: At that time all became land,

source: །སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་ཀུན་ཏུ་ཡང་།
en: And the entirety of this buddha realm

source: །མེ་ཏོག་དག་གིས་གཏོར་ཅིང་མཉམ་པར་གྱུར།
en: Became equally scattered with flowers. {86}

source: །འོད་ཟེར་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་དག །ཆོས་ཀྱི་རྒྱལ་པོའི་ཞབས་ཀྱི་མཐིལ་ནས་བྱུང་།
en: Countless hundreds of thousands of light rays Came from the soles of the King of Dharma’s feet.

source: །སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་བསིལ་བར་གྱུར།
en: All the beings in the hells were cooled

source: །སྡུག་བསྔལ་མེད་པར་བྱས་ནས་བདེ་བ་མྱོང་།
en: And, freed from suffering, experienced happiness. {87}

source: །དེར་ནི་སྟོབས་བཅུ་ལྡན་པས་ཆོས་བཤད་པས།
en: The one with the ten strengths taught the Dharma

source: །ལྷ་དང་མི་ཡི་མིག་ཀྱང་རྣམ་པར་དག །སྲོག་ཆགས་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་རྣམས།
en: So that the sight of devas and humans was purified. Countless hundreds of thousands of beings

source: །ཐམས་ཅད་སངས་རྒྱས་ཡེ་ཤེས་ངེས་པར་གྱུར། །འདྲེན་པ་གྲོང་ཁྱེར་མཆོག་ཏུ་གཤེགས་པ་ན།
en: All gained certainty in the Buddha’s wisdom. {88}

source: །བདེ་གཤེགས་ཆོ་འཕྲུལ་མང་པོ་དག་གིས་ནི།
en: The numerous miracles manifested by the Sugata

source: །བསྐལ་པ་བྱེ་བར་བརྗོད་དུ་མི་སླ་སྟེ།
en: Could not easily be described in ten million eons. When the Guide entered the supreme city

source: །རྒྱལ་བ་བདེ་གཤེགས་འགྲོ་བ་ཐམས་ཅད་དགའ།
en: All beings rejoiced at the Jina, the Sugata. {89}

source: །བདེ་གཤེགས་ཡོན་ཏན་དེ་དག་དཔག་མེད་དེ།
en: These qualities of the Sugata are immeasurable.

source: །མི་མཆོག་ཡོན་ཏན་རབ་ཀྱི་ཕ་རོལ་ཕྱིན།
en: They are the supreme human’s perfection of qualities.

source: །ཡོན་ཏན་ཁྱད་པར་ཀུན་གྱི་ཕ་རོལ་སོན།
en: They have transcended all unique qualities.

source: །སངས་རྒྱས་བསོད་ནམས་ཞིང་ལ་མགོས་ཕྱག་འཚལ།
en: Bow your heads to the realm of the Buddha’s merit! {90}

source: །གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།
en: Conclusion of the tenth chapter, “The Entry into the City.” Becoming a Keeper of the Sūtra Chapter 11

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་ཁྱིམ་གྱི་སྲང་དུ་བྱུང་སྟེ། །ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་ཁྱིམ་དུ་གཤེགས་སོ།
en: The Bhagavān came to the street on which was the home of the youth Candraprabha, and soon arrived at the home of the youth Candraprabha.

source: །གཤེགས་ནས་གདན་བཤམས་པ་ལ་བཞུགས་སོ།
en: Once he had arrived, he sat on the seat prepared for him.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་ཀྱང་སོ་སོར་གར་འོས་པའི་སྟན་ལ་འཁོད་དོ།
en: The saṅgha of bodhisattvas and the saṅgha of bhikṣus also sat on the appropriate seats that had been arranged for each of them.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། །དགེ་སློང་གི་དགེ་འདུན་བཞུགས་པར་རིག་ནས་མཆོད་ཡོན་ཆེན་པོ་རིམ་གྱིས་གསོལ་ཏེ།
en: Then the youth Candraprabha, knowing that the Bhagavān, the saṅgha of bodhisattvas, and the saṅgha of bhikṣus were seated, himself presented and served a series of great offerings:

source: །ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་བཟང་ཞིང་མང་བའི་བཟའ་བ་དང་། །བཅའ་བ་དང་བལྡག་པ་དང་གཞིབ་པ་དང་བཏུང་བ་རྣམས་བདག་ཉིད་ཀྱིས་གསོལ་ཅིང་བདར་ཏེ།
en: numerous excellent foods, with hundreds of flavors to savor as they chewed, licked, sucked, and drank.

source: །བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ནས་ལྷུང་བཟེད་བཞག་སྟེ་ཕྱག་བཅབས་པར་རིག་ནས་རས་བཅོས་བུ་ཕྲུགས་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་རི་བ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་སོ་སོར་ཆོས་གོས་སུམ་ཕྲུགས་སུ་ཕུལ་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་རས་གཏོར་ཏེ།
en: When he saw that the Bhagavān had concluded his meal, which was signaled by his setting down his alms bowl, he offered for the Bhagavān’s body two lengths of cloth of the value of a trillion silver coins, and also to each of the bodhisattvas, and he offered three dharma robes to each one in the saṅgha of bhikṣus. Then the youth Candraprabha rose from his seat, removed his robe from one shoulder and, casting toward the Bhagavān a divine coral tree flower, he made offerings and uttered praises.

source: མཆོད་ཅིང་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་དོ།
en: Then, his palms placed together, he bowed toward the Bhagavān and praised him with these appropriate verses:

source: །སྐྱེས་པ་མེད་ཅིང་འགགས་མེད་པ།
en: “You are unborn and unceasing;

source: །སྐུ་ལུས་མི་མངའ་བསམ་མི་ཁྱབ།
en: Without a body, inconceivable,

source: །གཟུགས་དང་མཚན་ནི་ཕུན་སུམ་ཚོགས།
en: You have the perfect body and primary signs.

source: །ཡོན་ཏན་རྒྱ་མཚོ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you who are an ocean of qualities. {i}

source: །དཔའ་བོ་ཤེས་རབ་མཆོག་གིས་བསྐྱེད།
en: “You are a hero who has been born from wisdom.

source: །ཐབས་དང་སྟོབས་ཀྱི་རྩལ་ཀྱང་མངའ།
en: You possess the power of methods and strengths.

source: །སངས་རྒྱས་ནམ་མཁའ་འདྲ་བ་སྟེ།
en: You are a buddha who is the same as space.

source: །བཟོད་མཐར་ཕྱིན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you who have perfected patience. {ii}

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞུགས་པའི་སྤྱོད་ཡུལ་ཏེ།
en: “Your conduct is to remain in constant mindfulness.

source: །དེ་བཞིན་གཤེགས་པའི་གཟིམས་མལ་རབ་ཏུ་དགའ་དང་བདེ།
en: The Tathāgata’s bed is joy and happiness.

source: །བཏུང་བར་ཏིང་ངེ་འཛིན་ཏེ་བཤོས་སུ་བསམ་གཏན་མཆོག །སྟོང་ཉིད་དགོན་པར་གནས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །རྒྱལ་བས་ཐུགས་རྗེ་བསྙེན་པས་ན། །གཟུགས་ཀྱི་སྐུ་ཡང་སྟོན་པར་མཛད། །སེམས་ཅན་དག་ལ་ཐུགས་བརྩེའི་ཕྱིར། །བཏུང་དང་བཤོས་ཀྱང་གསོལ་བར་གདའ།
en: Your drink is samādhi and your food is supreme dhyāna. I pay homage to you who reside in the solitude of emptiness. {iii}

source: །ཨེ་མ་སངས་རྒྱས་བསམ་མི་ཁྱབ།
en: “O Inconceivable Buddha,

source: །འཇིག་རྟེན་ཀུན་གྱི་འདྲེན་པ་སྟེ།
en: The Guide for the whole world!

source: །འཇིག་རྟེན་འདི་ནི་ཁྱོད་མཆོད་ནས།
en: When the beings of this world make offerings to you

source: །མྱ་ངན་འདས་པ་མཆོག་ཏུ་མཆི།
en: They advance toward supreme nirvāṇa.” {iv}

source: །མི་མཉམ་མཉམ་པའི་མགོན་གཅིག་པོ་ལ་དེ་སྐད་བསྟོད། །གཞོན་ནུ་ཡིད་ཀྱང་རབ་ཏུ་དགར་གྱུར་ཚིག་སྨྲས་པ། །སངས་རྒྱས་མཚུངས་མེད་བསམ་ཡས་སྐུ་མངའ་བཤོས་གསོལ་བས།
en: Thus did he praise the one unequaled Lord, and then the youth said, with a joyous mind, “Unequaled Buddha, who has an inconceivable body, you have consumed the meal.

source: །ལྷ་ཡི་ལྷ་ཁྱོད་བཞིན་དུ་བདག་ཀྱང་སངས་རྒྱས་གྱུར།
en: Through this may I also become a buddha like you, the god of gods!”

source: །དེ་ལྟར་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་ཞལ་ཟས་རོ་བརྒྱ་པ་ནི་བཞེས་པར་གསོལ། ལྷའི་ན་བཟའ་རིན་ཐང་མེད་པ་ཕྲུགས་ཀྱིས་ནི་སྐུ་ལ་གསོལ།
en: In that way, therefore, the youth Candraprabha provided divine food with a hundred flavors to the Bhagavān.

source: ལྷའི་མེ་ཏོག་མན་དཱ་རས་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད། ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པས་ནི་མངོན་པར་བསྟོད་ནས།
en: He offered divine coral tree flowers to the Bhagavān, and praised him with appropriate verses.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཡིད་ཀྱིས་ཚིགས་སུ་བཅད་པས་ཞུ་བ་ཞུས་པ།
en: Now, placing his palms together in homage toward the Bhagavān, in his mind he addressed him with these verses:

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་པས་ཅི་སྤྱད་ན།
en: “Whatever the wise bodhisattvas do,

source: །རྟག་ཏུ་ཆོས་རྣམས་རང་བཞིན་རབ་ཏུ་འཚལ།
en: They always follow the nature of the Dharma.

source: །མཁས་པ་བགྱི་བ་དག་ལ་ཇི་ལྟར་འཇུག །བགྱི་བར་འཇུག་པ་འདྲེན་པས་བསྟན་དུ་གསོལ།
en: I pray to the Guide to teach what actions are performed When those with wisdom engage in actions. {1}

source: །འདྲེན་པ་སྐྱེ་བ་དྲན་པར་ཇི་ལྟར་འགྱུར།
en: “In what way, Guide, are past lives remembered?

source: །ཇི་ལྟར་མངལ་དག་ཏུ་ཡང་ཡོང་མི་སྐྱེ།
en: In what way is rebirth in a womb avoided?

source: །ཇི་ལྟ་བུར་ན་འཁོར་རྣམས་མི་ཕྱེད་འགྱུར།
en: In what way does the community not become divided?

source: །འདི་ལ་ཇི་ལྟར་སྤོབས་པ་མཐའ་ཡས་འགྱུར།
en: In what way does one gain endless eloquence? {2}

source: །སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན།
en: “You know the activities of all beings.

source: །ཆོས་རྣམས་ཀུན་ལ་མངོན་པར་མཁྱེན་པ་འཇུག །རྐང་གཉིས་གཙོ་བོ་ཟིལ་གྱིས་མི་ནོན་པ།
en: You have the knowledge of all phenomena. You are the invincible, supreme human.

source: །ཞུ་བ་ཞུ་ཡིས་བདག་ལ་ལུང་སྟོན་ཅིག །ཆོས་ཀྱི་རང་བཞིན་དངོས་མེད་རབ་མཁྱེན་ལ།
en: I have asked my questions; give me your elucidation. {3} “You know that nonexistence is the nature of phenomena;

source: །བརྗོད་དུ་མེད་པ་ཚིག་ཏུ་བརྗོད་པར་མཛད།
en: You put into words that which cannot be described.

source: །སེང་གེས་ཝ་རྣམས་ཇི་ལྟར་ཕམ་བགྱིས་པ།
en: Just as a lion overpowers all jackals,

source: །མུ་སྟེགས་གཞན་ལའང་སངས་རྒྱས་དེ་བཞིན་ཏེ།
en: That is how the Buddha overpowers the tīrthikas. {4}

source: །སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་མཁྱེན་ཅིང་།
en: “You know the conduct of all beings.

source: །ཆོས་རྣམས་ཀུན་ལའང་ཡེ་ཤེས་རྗེས་སུ་འཇུག །ཡེ་ཤེས་ཆགས་མེད་སྤྱོད་ཡུལ་ཡོངས་སུ་དག །ཆོས་ཀྱི་མངའ་བདག་བདག་ལ་དེ་ལུང་སྟོན།
en: You have the wisdom of all phenomena. You have wisdom without attachment, and activity that is pure. Lord of the Dharma, elucidate those for me. {5}

source: །འདས་པ་མཁྱེན་ཅིང་མ་འོངས་དེ་བཞིན་ཏེ།
en: “You know the past and also the future.

source: །ད་ལྟར་འདི་ན་ཅི་མཆིས་པ་ཡང་མཁྱེན།
en: You also know what is happening in the present.

source: །དུས་གསུམ་ལ་ནི་ཡེ་ཤེས་ཐོགས་མེད་འཇུག །དེ་ཕྱིར་བདག་ཞུ་ཤཱཀྱ་སེང་གེ་ལ།
en: You have unimpeded knowledge of the three times. Therefore I have asked you my questions, lion of the Śākyas. {6}

source: །དུས་གསུམ་ལྡན་པའི་རྒྱལ་བའི་ཆོས་ཉིད་ནི། །ཆོས་ཀྱི་རྒྱལ་པོས་ཆོས་ཉིད་རབ་ཏུ་མཁྱེན།
en: “You, Dharma king, know the true nature That is the nature of the jinas of the three times.

source: །རང་བྱུང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་མཁས།
en: You are skilled in the nature of phenomena, self-arisen one.

source: །དེ་ཕྱིར་བདག་ཞུ་ཡེ་ཤེས་རྒྱ་མཚོ་ལ།
en: Therefore, ocean of wisdom, I have asked you my questions. {7}

source: །ཁྱོད་ལ་འཁྲུལ་པའི་ཆོས་ནི་ཅི་ཡང་མེད།
en: “You do not have any quality of error.

source: །དེ་བས་ཁྱོད་ཀྱི་སེམས་པ་མ་ལུས་སྤངས།
en: Therefore you have a mind of complete elimination—

source: །མདུད་སྤངས་ཐ་བ་གཏི་མུག་རབ་ཏུ་བཅད།
en: You have eliminated the fetters and the rigidity of ignorance.

source: །མི་དབང་བདག་ལ་བྱང་ཆུབ་སྤྱོད་པ་སྟོན།
en: Lord of humans, teach me the conduct of a bodhisattva. {8}

source: །ཆོས་ཀྱི་མཚན་ཉིད་ཅི་འདྲར་རྒྱལ་བས་མཁྱེན།
en: “You, Jina, know the characteristics of phenomena.

source: །ཆོས་ཀྱི་མཚན་ཉིད་དེ་འདྲ་བདག་ལ་སྟོན།
en: Teach me the characteristics of phenomena.

source: །བདག་གིས་མཚན་ཉིད་དེ་འདྲའི་ཆོས་རྟོགས་ནས།
en: When I have understood those characteristics of phenomena

source: །མཚན་ཉིད་དེ་འདྲའི་བྱང་ཆུབ་སྤྱོད་པ་སྤྱད།
en: I shall practice the conduct of enlightenment that has those characteristics. {9}

source: །སེམས་ཅན་སྤྱོད་པ་མི་འཐུན་མཐའ་ཡས་པ།
en: “The conduct of beings is infinitely different.

source: །ཇི་ལྟར་སྤྱོད་པ་སྤྱད་པར་འཇུག་པ་ལགས། །གང་ཐོས་སེམས་ཅན་སྤྱོད་པ་འཚལ་འགྱུར་བ།
en: How do they engage in practicing their conduct?

source: །སྤྱོད་ལ་འཇུག་པ་བདག་ལ་བཤད་དུ་གསོལ།
en: Teach to me how conduct is engaged in So that from your words, I may know the conduct of beings. {10}

source: །མཚན་ཉིད་མི་འཐུན་ཆོས་ཀྱི་རང་བཞིན་མཚན།
en: “Different characteristics are characteristic of the nature of phenomena.

source: །ངོ་བོ་ཉིད་སྟོང་རང་བཞིན་རྣམ་དག་པ། །བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་མངོན་སུམ་འགྱུར།
en: Their essence is empty and their nature is pure.

source: །ཆོས་ཀྱི་ཚུལ་རྣམས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you teach me the way of phenomena That a bodhisattva directly perceives. {11}

source: །འདི་ལ་ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན།
en: “In this there is the perfect knowledge of all phenomena.

source: །བསྟན་པའི་ཚིག་ཀུན་ལ་ཡང་ཤིན་ཏུ་མཁས།
en: There is skill in all the words of the teaching.

source: །ཐེ་ཚོམ་མི་མངའ་ནེམ་ནུར་ཐེ་ཚོམ་ཆོད།
en: There is no doubt; all doubt and uncertainty have been cut through.

source: །བདག་ལ་སངས་རྒྱས་བྱང་ཆུབ་བསྟན་དུ་གསོལ།
en: Teach me the enlightenment of buddhahood.” {12}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་སེམས་ཀྱི་རྟོགས་པ་སེམས་ཀྱིས་མཁྱེན་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཅིག་དང་ལྡན་ན་ཡོན་ཏན་འདི་དག་རབ་ཏུ་འཐོབ་སྟེ། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: The Bhagavān, knowing the thoughts that were in the mind of the youth Candraprabha, said to him, “Young man, bodhisattva mahāsattvas will attain all these qualities, and they will quickly attain the highest, complete enlightenment of perfect buddhahood, if they possess just one quality.

source: །ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: What is that one quality?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: Young man, it is when the bodhisattva mahāsattvas know the nature of all phenomena.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཤེས་ཞེ་ན།
en: “Young man, how do bodhisattva mahāsattvas know the nature of all phenomena?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་མིང་མེད་ཅིང་མིང་དང་བྲལ་བར་རབ་ཏུ་ཤེས་སོ། །ཆོས་ཐམས་ཅད་སྒྲ་མེད་པ། ཚིག་གི་ལམ་དང་བྲལ་བ། ཡི་གེ་དང་བྲལ་བ། སྐྱེ་བ་དང་བྲལ་བ། འགོག་པ་དང་བྲལ་བ། རྒྱུ་དང་མཚན་ཉིད་མི་འཐུན་པ། རྐྱེན་དང་མཚན་ཉིད་མི་འཐུན་པ། དབེན་པའི་མཚན་ཉིད་འདི་ལྟ་སྟེ། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ། མཚན་ཉིད་དང་བྲལ་བ། བསམ་གྱིས་མི་ཁྱབ་པ། བསམ་པ་དང་བྲལ་བ། ཡིད་དང་བྲལ་བར་རབ་ཏུ་ཤེས་སོ།
en: Young man, bodhisattva mahāsattvas know that all phenomena are nameless; they have no names. They know that all phenomena have no vocalization, they have no expression in speech, they have no letters, they have no birth, they have no cessation, they have no characteristics of cause, they have no characteristics of conditions, they are devoid of characteristics, they have the one characteristic of having no characteristics, they are devoid of attributes, they cannot be conceived of, they have no thought, and they have no mentality.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Then the Bhagavān taught this in the following verses:

source: །ཆོས་རྣམས་བསྟན་པ་གཅིག་པོ་ནི།
en: “The single teaching on phenomena

source: །ཆོས་རྣམས་ཐམས་ཅད་མཚན་ཉིད་མེད། །ཡང་དག་ཇི་བཞིན་རབ་མཁྱེན་པས།
en: Is that phenomena have no characteristics.

source: །ཤེས་རབ་མཆོག་གིས་བཤད་པ་ཡིན། །དེ་ལྟ་བུར་ནི་ཆོས་བསྟན་རྣམས།
en: That is the teaching of supreme wisdom From having true, correct knowledge. {13}

source: །བྱང་ཆུབ་སེམས་དཔའ་སུས་ཤེས་པ།
en: “The bodhisattvas who know That teaching on phenomena Will not cease from elucidation

source: །མདོ་སྡེ་བྱེ་བ་རབ་སྟོན་ཀྱང་། །དེ་ལ་བྱང་ཆུབ་རྒྱུན་འཆད་མེད།
en: Even though they teach ten million sūtras. {14}

source: །འདྲེན་པས་བྱིན་གྱིས་བརླབས་པས་ན།
en: “Through the blessing of the Guide

source: །ཡང་དག་ཉིད་ཀྱི་མཐའ་ཡང་ཤེས།
en: The ultimate truth is known.

source: །ཡང་དག་མཐའ་དེ་རབ་ཤེས་ན།
en: When the ultimate is known

source: །དེ་ལ་ཅི་ཡང་བཤད་པ་མེད།
en: There is nothing to be taught. {15}

source: །གཅིག་གིས་ཀྱང་ནི་ཐམས་ཅད་ཤེས།
en: “Through one thing, everything is known.

source: །གཅིག་གིས་ཀྱང་ནི་ཐམས་ཅད་མཐོང་།
en: Through one thing, everything is seen.

source: །ཇི་སྙེད་མང་པོར་བཤད་ན་ཡང་།
en: However much they teach

source: །དེ་ལ་དྲེགས་པ་སྐྱེ་བ་མེད།
en: They will not become proud. {16}

source: །ཆོས་རྣམས་ཐམས་ཅད་བདག་མེད་པར། །དེ་ལྟར་སེམས་ཀྱིས་ངེས་བརྟགས་ཤིང་།
en: “With their minds they have ascertained The selflessness of all phenomena,

source: །མིང་དུ་བསྟན་པ་བསླབས་པས་ན།
en: And as they are trained in teaching using terms,

source: །ཡང་དག་ཉིད་དུ་ཚིག་ཀྱང་སྨྲ།
en: They speak with words that are correct. {17}

source: །སྒྲ་དབྱངས་གང་དག་ཅི་ཐོས་པ།
en: “Whatever sound they hear,

source: །དེ་ཡི་སྔོན་གྱི་མཐའ་ཤེས་ཏེ།
en: They know its past.

source: །སྒྲ་ཡི་སྔོན་གྱི་མཐའ་ཤེས་ནས།
en: Knowing the past of that sound

source: །སྒྲ་དག་གིས་ནི་དེ་མི་འཕྲོགས།
en: They are not captivated by that sound. {18}

source: །སྒྲ་ཡི་སྔོན་མཐའ་ཇི་འདྲ་བར།
en: “Just like the past of a sound,

source: །ཆོས་རྣམས་མཚན་ཉིད་དེ་བཞིན་ཏེ། །ཆོས་རྣམས་དེ་ལྟར་རབ་ཤེས་ན།
en: So are the characteristics of phenomena. Knowing phenomena to be like that

source: །མངལ་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: They will not be reborn in a womb. {19}

source: །ཆོས་རྣམས་ཐམས་ཅད་མི་སྐྱེ་ཞིང་། །འབྱུང་བ་མེད་པར་རབ་ཏུ་ཤེས།
en: “They know that all phenomena are unborn And that they have no origin.

source: །བསྟན་པ་འདི་ནི་རབ་ཤེས་ན།
en: Knowing this teaching on birth

source: །རྟག་ཏུ་སྐྱེ་བ་དྲན་པར་འགྱུར།
en: They always remember their previous lives. {20}

source: །ནམ་ཞིག་སྐྱེ་བ་དྲན་གྱུར་ན།
en: “When they remember those lives

source: །དེ་ཚེ་བྱ་བ་དག་ལ་འཇུག །བྱ་བ་དག་ལ་ཞུགས་པ་ཡི།
en: They perform their actions. For those who perform those actions

source: །འཁོར་རྣམས་ཤིན་ཏུ་མི་ཕྱེད་འགྱུར། །དེ་ལྟར་ཆོས་རྣམས་སྟོང་པར་ནི།
en: Their community of followers remains united. {21}

source: །དེས་ནི་གང་ཡང་མི་ཤེས་མེད།
en: Will never be without that knowledge.

source: །འདི་ནི་ཅི་ཡང་མེད་པའི་མཐའ།
en: It is the summit of nothingness. {22} “When the foolish think about

source: །ཅི་ཡང་མེད་པའི་མཐའ་ལ་ཡང་།
en: The summit of nothingness

source: །བྱིས་པ་དག་གིས་ཅི་དག་བརྟགས།
en: They continue in saṃsāra

source: །བསྐལ་པ་བྱེ་བར་དེ་དག་དེས།
en: For millions of eons. {23}

source: །ཡང་དང་ཡང་དུ་འཁོར་བར་གྱུར།
en: “If they are able to understand it

source: །ཇི་ལྟར་འདྲེན་པས་མཁྱེན་པ་བཞིན། །གལ་ཏེ་དེ་དག་རྟོག་རིག་ན།
en: Just as the Guide knows it,

source: །དེ་ལས་སྡུག་བསྔལ་མི་སྐྱེ་སྟེ།
en: Then they will have no suffering

source: །ངན་འགྲོ་རྣམས་སུའང་དེ་མི་འགྲོ།
en: And they will not go to the lower realms. {24}

source: །སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས།
en: “All ordinary individuals

source: །དེ་ལྟར་ཚུལ་འདི་མ་ཤེས་པས། །གང་དུ་ཆོས་རྣམས་འགག་པ་ཡི།
en: Are ignorant of this nature.

source: །འདི་འདྲའི་ཆོས་རྣམས་སྤོང་བར་བྱེད།
en: They reject this kind of Dharma That brings the cessation of suffering. {25} “Phenomena are perceived when

source: །ཆོས་ཀུན་རྙེད་པ་མེད་པར་ནི། །ཆོས་ཀྱི་འདུ་ཤེས་གང་བྱུང་བ།
en: No phenomena can be found.

source: །དེ་ལྟ་བུ་ཡི་འདུ་ཤེས་ཏེ།
en: Recognize that perception

source: །འདུ་ཤེས་དེ་ལྟར་རིག་པར་གྱིས།
en: When that perception occurs. {26}

source: །རྣམ་པར་ཤེས་དང་འདུ་ཤེས་སུ། །བྱིས་པ་དག་གིས་འདི་བརྟགས་ཏེ།
en: “The foolish conceptualize Through consciousness and perception. The wise do not become ignorant

source: །བརྟགས་པ་ཡི་ནི་ཆོས་རྣམས་ལ། །མཁས་པ་འདིར་ནི་རྨོངས་མི་འགྱུར། །སྟོང་པ་རྙོག་པ་མེད་པའི་ཆོས།
en: In conceiving of phenomena. {27} “The unpolluted phenomena of emptiness Are within the field of experience of the bodhisattvas.

source: །འདི་ནི་མཁས་པའི་ས་ཡིན་ཏེ།
en: This level of those who are wise

source: །འདི་ལ་བྱིས་པའི་སྤྱོད་ཡུལ་མེད། །སངས་རྒྱས་སྲས་ཀྱི་སྤྱོད་ཡུལ་ལོ། །ཞི་བ་སྟོང་པ་རབ་བསྟན་པ།
en: Is not within the field of experience of the foolish. {28}

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས། །འདི་ནི་སངས་རྒྱས་སྲས་སྤྱོད་པ།
en: “This level of the bodhisattvas Is that of bodhisattva practice.

source: །སངས་རྒྱས་ཆོས་ཀྱི་རྒྱན་ཡིན་ནོ།
en: It is the adornment of the Buddha’s Dharma. It is the peace and emptiness that has been taught. {29}

source: །འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དག །བག་ཆགས་རབ་ཏུ་སྤངས་གྱུར་པ།
en: “When the bodhisattvas Eliminate their propensities

source: །དེ་དག་གཟུགས་ཀྱིས་མི་འཕྲོགས་ཏེ། །སངས་རྒྱས་རིགས་ལ་དེ་དག་གནས།
en: They remain in the family of the buddhas And are not captured by form. {30}

source: །ཆོས་རྣམས་ཐམས་ཅད་གནས་མེད་དེ།
en: “All phenomena are without location;

source: །དེ་དག་ལ་ནི་གནས་ཡོད་མིན།
en: They have no location that can be known.

source: །གང་གིས་དེ་ལྟར་གནས་ཤེས་པ།
en: For the one who knows this about their location,

source: །དེ་ལ་བྱང་ཆུབ་རྙེད་མི་དཀའ།
en: Enlightenment is not difficult to attain. {31}

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཐོས་དང་བཟོད།
en: “Generosity, conduct, learning, and patience,

source: །བཤེས་གཉེན་བཟང་པོ་བསྟེན་བྱས་ནས།
en: And relying upon a good friend:

source: །བྱ་བ་འདི་དག་རྣམ་རིག་ན།
en: Those who know these activities

source: །བྱང་ཆུབ་མྱུར་དུ་དེ་འཚང་རྒྱ།
en: Will quickly attain enlightenment. {32} “Devas, nāgas, yakṣas, and asuras,

source: །དེ་ལ་ལྷ་ཀླུས་རྟག་ཏུ་བཀུར་སྟི་བྱེད།
en: Mahoragas and gandharvas, will always honor them.

source: །གནོད་སྦྱིན་ལྷ་མིན་ལྟོ་འཕྱེ་དྲི་ཟ་དང་། །ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ཐམས་ཅད་དང་། །མི་འམ་ཅི་དང་སྲིན་པོས་མཆོད་པ་བྱེད།
en: All the kings of the garuḍas, kinnaras, And rākṣasas will make offerings to them. {33}

source: །སངས་རྒྱས་བྱེ་བ་དེ་ཡི་སྙན་པ་བརྗོད།
en: “Millions of buddhas will recite their praises

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་མི་འཆད་པར།
en: Continuously for many millions of eons.

source: །ཆོས་བཤད་པ་ཡི་བསྔགས་པ་བརྗོད་ན་ཡང་། །དེ་ཡི་མུ་མཐའ་ཟད་པར་ནུས་མི་འགྱུར།
en: It is not possible to reach the end Of such praise for one who teaches this Dharma. {34}

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་སྟོང་ཤེས་པ།
en: “The bodhisattvas who know emptiness

source: །དེ་ནི་སྲོག་ཆགས་བྱེ་བའི་དོན་མང་བྱེད།
en: Benefit many millions of beings.

source: །ཤིན་ཏུ་དེས་པས་འཁོར་ལ་ཆོས་སྟོན་ཏེ།
en: They kindly teach the Dharma to assemblies

source: །ཐོས་ནས་དགའ་ཞིང་རི་མོར་བྱེད་པ་སྐྱེད།
en: And those who hear it are delighted and respectful.{35}

source: །དེ་དག་གིས་ནི་ཡེ་ཤེས་ཡངས་པ་འབྱུང་།
en: “They gain vast knowledge

source: །དེ་ཕྱིར་རྒྱལ་བ་མི་མཆོག་མཐོང་བར་འགྱུར།
en: So that they see the supreme humans.

source: །ཞིང་རྣམས་ན་ཡང་བཀོད་པ་བཟང་པོ་མཐོང་།
en: They see the beautiful display of their realms

source: །འཇིག་རྟེན་མགོན་པོ་དེ་ལ་ཆོས་རྣམས་སྟོན།
en: And the lords of the worlds teach them the Dharma. {36}

source: །ཆོས་ཀུན་སྒྱུ་མ་ལྟ་བུར་ཤེས་པར་གྱིས།
en: “Know that all phenomena are like illusions;

source: །ཇི་ལྟར་བར་སྣང་རང་བཞིན་སྟོང་པ་ལྟར།
en: Know that just as space is naturally empty,

source: །དེ་དག་གི་ཡང་རང་བཞིན་དེ་འདྲར་ཤེས།
en: Phenomena are also naturally like that.

source: །དེ་ལྟར་སྤྱོད་པ་ཅི་ལའང་ཆགས་མི་འགྱུར། །ཡེ་ཤེས་ཆགས་པ་མེད་ཅིང་དོན་བྱེད་ཅིང་།
en: In that way there will be no attachment in any kind of activity. {37} “With unimpeded wisdom, benefiting others,

source: །འཇིག་རྟེན་ན་ཡང་བྱང་ཆུབ་སྤྱད་མཆོག་སྤྱོད།
en: Performing supreme bodhisattva conduct in the world,

source: །ཤེས་པས་ཆོས་ཀུན་ལ་ཡང་རབ་བརྟགས་ཏེ།
en: With wisdom examining all phenomena,

source: །དེ་དག་ཞིང་རྣམས་གཞན་དུའང་སྤྲུལ་པ་འགྱེད།
en: They send emanations to other realms. {38}

source: །སྤྲུལ་པ་དེ་དག་སངས་རྒྱས་དོན་བྱས་ནས།
en: “Those emanations accomplish buddha activities.

source: །ཇི་ལྟར་ཆོས་ཉིད་བཞིན་དུ་རང་བཞིན་འགྱུར།
en: They go naturally, just as is their nature.

source: །བྱང་ཆུབ་སེམས་ལ་མི་གང་གནས་པ་རྣམས།
en: The beings who remain in the aspiration to enlightenment

source: །བསམ་པ་ཇི་བཞིན་དོན་རྣམས་རྙེད་པར་འགྱུར།
en: Will attain whatever goals they wish for. {39}

source: །སངས་རྒྱས་རིགས་ནི་གནས་པར་གང་བརྩོན་པ།
en: “Those who are steadfastly within the buddha family

source: །དེ་ནི་རྟག་ཏུ་སངས་རྒྱས་བྱས་པ་གཟོ།
en: Will always honor the buddhas.
